{"data":{"markdownRemark":{"html":"<figure class=\"figure--flush\">\n  <img src=\"/assets/articles/designed-by-few-2016/dxf.png\" alt=\"\">\n</figure>\n<p>Last week I had the chance to do something I’ve never done before: take part in a design competition where I (along with 2 other talented designers) were given 2 hours to design something for a charity in front of hundreds of other designers. Suffice to say, it was stressful. Good stressful. To add to the fun, this all took place during the <a href=\"https://madebyfew.com\">Made By Few</a> Halloween party.</p>\n<figure class=\"figure--right\">\n  <img src=\"/assets/articles/designed-by-few-2016/photo-booth.png\" alt=\"\">\n</figure>\n<p>So, armed with my Kylo Ren mask and my lightsaber, I hooked up my MacBook to the projector still waiting to hear what we would have to design in front of this big crowd. I was really hoping for it not to be designing a logo. Logos really aren’t my strong suit and it’s always a painful experience for me, so I had my fingers crossed.</p>\n<h2>So we’d like you to design a logo for Art Feeds Day!</h2>\n<aside class=\"figure--left\">\n  <h4>About Art Feeds</h4>\n  <p><a href=\"http://artfeeds.org\">​Art Feeds</a> is a charity that exist to feed creative development and facilitate emotional expression in children through art and community. To do this, they provide free therapeutic art and creative education programs within schools &amp; children’s organizations by mobilizing teams of community members to bring all forms of art into classrooms.</p>\n</aside>\n<p><em>Shit. Alright, you can do this.</em> On top of designing a new logo we also had to design a flyer to promote the event. I was much more confident about designing a flyer than a logo, but I knew the logo would set the direction for the rest of the project so I started with that.</p>\n<p>I really underestimated how stressful it was to have all those people looking at your screen when all you have is <a href=\"https://twitter.com/alexcornell/status/792173654989615104\">a blank Sketch file</a>. I felt this urge to produce something amazing right off the bat, which of course never leads to a good solution. So I decided to stop looking around, focus on my screen and to get the bad ideas out of my system.</p>\n<p><img src=\"/assets/articles/designed-by-few-2016/logo-progress.gif\"></p>\n<p>For a while it seemed like I wasn’t going anywhere, but suddenly things started falling into place. The type, the color, the feel — it started to resemble a logo I wouldn’t be ashamed to show everyone. <em>I quickly looked at the time. More than an hour had passed. Damn, I better speed things up.</em></p>\n<p>The flyer happened pretty quickly, I was in my element. There were three things I knew I absolutely wanted to highlight in the flyer:</p>\n<ul>\n<li>The fantastic mission of Art Feeds</li>\n<li>The beautiful Instagram pictures of people customizing their t-shirt</li>\n<li>How to participate and get involved</li>\n</ul>\n<p>Before I knew it, I had a pretty good brand system in place. I put the last few finishing touches (brush strokes, illustrations of the different steps, coaster design) and the time was up. I had no idea how the other two did. I really wanted to focus on my design and not get influenced by the other two’s vision of how this event should be represented.</p>\n<p class=\"pull-quote\">I think it can be hard for us designers to show work that isn’t perfect all the time, but we have to accept the fact that it’s a process.</p>\n<figure class=\"figure--extend-right\">\n  <img src=\"/assets/articles/designed-by-few-2016/my-final.png\" alt=\"\">\n  <figcaption>This is the final piece I created in the two hours we were given. My goal was to refresh the brand, without losing the fun and creative nature of the event.</figcaption>\n</figure>\n<h2>The reveal</h2>\n<p>We then all presented our design to the whole crowd. It was really fun seeing people’s reaction to our explanations. I was excited to see the Amy’s and Daniel’s designs and I’m happy I waited. They did a fantastic job. It was really cool to see that everyone of us had taken things into a totally different direction.</p>\n<p>After some deliberation, the judges named the winner: <strong>Daniel Herron!</strong> 🎉</p>\n<figure class=\"figure--extend-right\">\n  <img src=\"/assets/articles/designed-by-few-2016/final-posters.jpg\" alt=\"\">\n  <figcaption>From left to right: Amy Johnson's flyer, Daniel Herron's flyer and my flyer.</figcaption>\n</figure>\n<p>I ultimately didn’t win, but I’m super happy for Daniel — he really deserved it. The experience was incredible and I’d totally recommend it to everyone. I think it can be hard for us designers to show work that isn’t perfect all the time, but we have to accept the fact that it’s a process. No idea starts out as a beautiful, fully formed designed, it takes a lot of time and iteration to get there. On top of that, we got to do something from a charity that does amazing work. Huge thanks to the <a href=\"https://madebyfew.com\">Made by Few</a> organizers for giving us the opportunity to do something like that.</p>","frontmatter":{"pretitle":null,"title":"Designed By Few 2016","date":"06.11.16"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/articles/designed-by-few-2016/"}}