{"data":{"markdownRemark":{"html":"<p>Last week I asked people on Twitter if they considered themselves a generalist or a specialist. Here are the results:</p>\n<blockquote class=\"twitter-tweet\" data-lang=\"en\"><p lang=\"en\" dir=\"ltr\">Good morning! Quick question: do you consider yourself a specialist or a generalist? [Twitter Poll]</p>&mdash; Kevin Clark (@vernalkick) <a href=\"https://twitter.com/vernalkick/status/700311311880744960\">February 18, 2016</a></blockquote> <script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>While I do think that there’s no good answer, I think I’m more of a generalist as well. (Self selection maybe?) I get bored easily, so learning new stuff constantly keeps my brain engaged. A lot of interesting things happen <a href=\"http://www.frankchimero.com/writing/designing-in-the-borderlands/\">at the borderlands</a>.</p>\n<p>I also find that there are diminishing returns to becoming the very very best at something. <a href=\"http://dilbertblog.typepad.com/the_dilbert_blog/2007/07/career-advice.html\">This article on the Dilbert blog</a> articulates this idea well:</p>\n<blockquote>\n<p>[Becoming the very best at one specific thing] is difficult to the point of near impossibility. Few people will ever play in the NBA or make a platinum album. I don’t recommend anyone even try.</p>\n</blockquote>\n<blockquote>\n<p>The second strategy is fairly easy. Everyone has at least a few areas in which they could be in the top 25% with some effort. In my case, I can draw better than most people, but I’m hardly an artist. And I’m not any funnier than the average standup comedian who never makes it big, but I’m funnier than most people. The magic is that few people can draw well and write jokes. It’s the combination of the two that makes what I do so rare. And when you add in my business background, suddenly I had a topic that few cartoonists could hope to understand without living it.</p>\n</blockquote>\n<p>That being said, I really like the romanticism of someone dedicating their whole life to mastering their craft. There’s definitely something to be said about that level of dedication. What’s great about it is the right answer is going to be different for everyone.</p>\n<p>Big thanks to everyone who participated in the poll, I really appreciate it. If you have more thoughts to share now that the results are out, <a href=\"http://twitter.com/vernalkick\">let me know on Twitter</a>!</p>","frontmatter":{"pretitle":null,"title":"Generalist vs Specialist","date":"21.02.16"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/articles/2016-02-21-generalist-vs-specialist/"}}