{"data":{"markdownRemark":{"html":"<figure class=\"figure--flush\">\n  <img src=\"/assets/articles/our-best-meetup-so-far/meetup-banner.jpg\" alt=\"\">\n</figure>\n<p>Last Tuesday we (Shopify) hosted the 6th <a href=\"http://mtldribbblemeetup.com\">MTL Dribbble Meetup</a>, but it was the first in our <a href=\"https://www.flickr.com/photos/44922604@N03/albums/72157661314603955\">brand new office space</a>. Our lounge area was designed with events like this in mind, so it was great to see it fill up with lots of amazing people. Another thing that made this event special was the fact that we had two amazingly talented speakers take the stage for the first time:</p>\n<ul>\n<li><a href=\"https://twitter.com/ShelleyTran\">Shelley Tran</a> talked about the Hook Model, the thing that keeps users engaged with your app or service. It’s definitely something to keep in mind in the design process.</li>\n<li><a href=\"https://twitter.com/catherinelegrs\">Catherine Legros</a> talked about her experience living abroad and co-founding a startup while learning to become a better designer.</li>\n</ul>\n<figure class=\"figure--extend-right\">\n  <img src=\"/assets/articles/our-best-meetup-so-far/dribbble-meetup-photo-collage.jpg\" alt=\"\">\n  <figcaption>You can find all the pictures I took during the event in this <a href=\"https://www.flickr.com/photos/44922604@N03/albums/72157661485084670\">Flickr album</a>.</figcaption>\n</figure>\n<p>We even got 96 RSVPs, which is the most that we’ve ever had. When I got up on stage I had this realization of just how much the Montreal design community has grown in the past couple of years. We even got a <a href=\"https://twitter.com/dribbble/status/671765224165261312\">tweet from the official Dribbble account</a>, which helped spread out the word about the event.</p>\n<p>I met a lot of new interesting people, heard two inspiring talks and saw a bunch of friends and got to show them our new space. I’m super happy of how the event turned out, and speaking to a lot of attendees, they loved it even more! We’ve already started planning the next couple of events and are looking for great speakers to tell us about something they’re passionate about.<sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup> If you’ve been wanting to do a talk for a long and never got around to it, <a href=\"mailto:kevin@kevinclark.ca\">now’s the time</a>!</p>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-1\">\n<p>The <a href=\"http://mtldribbblemeetup.com\">Dribbble Meetup</a> is a great event for first time speakers. Because it’s a smaller, more intimate event, we can spend time helping the speakers refine their message and deliver an amazing presentation. Seriously, <a href=\"mailto:kevin@kevinclark.ca\">just do it</a>.</p>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>","frontmatter":{"pretitle":null,"title":"Our best meetup so far","date":"05.12.15"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/articles/2015-12-05-our-best-meetup-so-far/"}}