{"data":{"markdownRemark":{"html":"<p>Dustin Senos, product designer at Medium recently <a href=\"https://medium.com/inside/reducing-design-friction-e619346dd651\">investigated the biggest causes of design friction within different design teams</a>. The number one issue he found was not knowing the problem you’re designing for:</p>\n<blockquote>\n<p>When you don’t know the problem you’re solving for, you gravitate towards using your center of gravity to solve the problem rather than the appropriate fidelity. You may start with visual design (because that’s what you’re good at) when you should really be thinking about layout or user flows.</p>\n</blockquote>\n<blockquote>\n<p>When you don’t know the problem you’re solving for, it’s hard to start with breadth. You often settle on the first solution that comes to you. How could you approach a problem from multiple angles if you can’t pinpoint the center of the problem?</p>\n</blockquote>\n<p>This is definitely a huge issue amongst most design teams. The best way I have found to mitigate that is to:</p>\n<ol>\n<li>\n<p><strong>Take things slowly</strong>. Talk to users, see what their needs are. Look at how other people have done it in the past and find what works and what didn’t. This is the design research phase.</p>\n</li>\n<li>\n<p><strong>Run a design sprint</strong>. Get designers, product managers, and even developers in a room together and brainstorm different approaches to tackle the problem you want to solve. <a href=\"https://medium.com/@gbeldam/sprint-to-the-finish-40bd9edba63e\">You can read more about how we run design sprints here</a></p>\n</li>\n<li>\n<p><strong>Prototype stuff</strong>. It’s near impossible to know if an idea works unless you can try it in action. You’ll learn a lot about how successful your solution is going to be when it’s fully fledged out if you can try it.</p>\n</li>\n</ol>\n<p>Taking the time to do these steps at the beginning of a project can save you a lot of time down the road. Solving a problem you fully understand is like doing an exam with the answers next to you.</p>","frontmatter":{"pretitle":null,"title":"Dustin Senos on Reducing Design Friction","date":"29.12.14"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/articles/2014-12-29-dustin-senos-on-reducing-design-friction/"}}