{"data":{"markdownRemark":{"html":"<p><img src=\"http://blogs-images.forbes.com/anthonykosner/files/2014/10/apple-watch-selling-points.jpg\" alt=\"The Apple Watch&#x27;s homescreen looks awesome, but finding an app on it seems overly cumbersome.\"></p>\n<p>Mark Gurman is on a roll with Apple leaks lately. <a href=\"http://9to5mac.com/2015/01/13/apple-watch-iphone-companion-app-revealed-with-new-watch-features-monograms/\">He recently published a piece on the purported Apple Watch companion app</a>. I have a few initial thoughts on the information we got from his post:</p>\n<ul>\n<li>\n<p>At first glance, it looks like there’s going to be a <em>lot</em> of settings. Normally, this is a sign of weak design, but it that case I think it might be necessary. The watch has the potential to get pretty obtrusive if you don’t have fine-grained control over which apps can notify you at any time during the day. I also think that they chose the right defaults, eg. mirroring what you have on your phone by default and allowing you to override the ones you need to.</p>\n</li>\n<li>\n<p>The homescreen layout section makes me really anxious. I feel like organizing apps is going to be extremely convoluted. For example, where does the icon for a newly installed app show up? Impossible to predict from what I’m seeing here. I hope they sort this out before launch.</p>\n</li>\n<li>\n<p>You will be able to unlock your Apple Watch when you unlock your phone. While it’s pretty easy to unlock your phone with Touch ID, I feel like this is a bit backwards. It’d be great if I <em>didn’t</em> have to unlock my phone while wearing my watch (and thus being in close proximity with my phone). The way they’re approaching it seems less useful, but is probably more secure. Acceptable trade off?</p>\n</li>\n</ul>","frontmatter":{"pretitle":null,"title":"On the Apple Watch Companion App","date":"2015-01-13T00:00:00.000Z"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/articles/2015-01-13-on-the-apple-watch-companion-app/"}}