{"data":{"markdownRemark":{"html":"<div><p>I recently rewrote the <a href=\"http://mtldribbblemeetup.com\">Montreal Dribbble Meetup website</a> using Sinatra. The previous version was simply static HTML and CSS files, so hosting and using a custom domain name was easy.</p><p>Since I moved to something dynamic (for various reasons), I decided to host the website on <a href=\"http://heroku.com\">Heroku</a> for simplicity reasons. Pushing something to <a href=\"http://heroku.com\">Heroku</a> is beautifully simple, but unfortunately looking at the <a href=\"http://heroku.com\">Heroku</a> documentation, I discovered that <a href=\"https://www.hover.com\">Hover</a>, where I had my domain name doesn’t support setting a <code>CNAME</code> for root domains. Bummer.</p><figure>\n  <blockquote class=\"twitter-tweet\" lang=\"en\">\n    <p lang=\"en\" dir=\"ltr\">Hover is great at everything except to use with Heroku. What are the cool kids using for custom domain names these days?</p>&mdash; Kevin Clark (@vernalkick) <a href=\"https://twitter.com/vernalkick/status/618216773037461505\">July 7, 2015</a>\n  </blockquote>  <script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>  <figcaption>Asking around on Twitter, there didn't seem to be any consensus on what to use.</figcaption>\n</figure><p>Fortunately, <a href=\"http://heroku.com\">Heroku</a> provides a list of DNS services that support that feature. Looking at the list, the only two names that rang a bell were DNS Simple and <a href=\"https://www.cloudflare.com\">CloudFlare</a>. DNS Simple’s pricing structure seems uh… anything but simple. So I went with <a href=\"https://www.cloudflare.com\">CloudFlare</a>. For my needs, the free <a href=\"https://www.cloudflare.com\">CloudFlare</a> plan was more than enough.</p><p><img src=\"http://cl.ly/image/052j1V2a1D3v/1\"></p><p>The setup process is surprisingly pretty seamless. You enter your domain name and they import your existing DNS records and tell you exactly what to replace in order to switch over to <a href=\"https://www.cloudflare.com\">Cloudflare</a>. Kudos for the amazingly simple onboarding experience.</p><p>Once that was done, all I had to do was add a <code>CNAME</code> record with my domain name (<a href=\"http://mtldribbblemeetup.com\">mtldribbblemeetup.com</a>) pointing to the <a href=\"http://heroku.com\">Heroku</a> URL (<a href=\"http://mtldribbblemeetup.com\">mtldribbblemeetup.herokuapp.com</a>). Done!</p><p>The whole process took roughly 10 minutes and the site was already accessible at the custom domain name. Couldn’t recommend <a href=\"https://www.cloudflare.com\">Cloudflare</a> enough as a DNS provider for sites hosted on Heroku.</p></div>","frontmatter":{"pretitle":null,"title":"Custom Domains with Heroku","date":"11.07.15"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/articles/2015-07-11-custom-domains-with-heroku/"}}