{"data":{"markdownRemark":{"html":"<p><video src=\"/f8f4727d173bad8954b107319cd50a8e/anotha.mov\">&#x3C;/video?</p>\n<p>I’m so happy to finally be able to share with the world <a href=\"https://www.shopify.com/email-marketing\">Shopify Email</a>. It’s an email marketing tool built from the ground up for commerce. Even if there’s tons of other marketing tools out there, we found that there was still a huge barrier to entry to email marketing. Why? Because it’s hard to know where to start, it’s time consuming and it’s hard to get actionable feedback on how well your campaigns are doing. So we’ve decided we would tackle these problems head on. In order to do that, we had to unlearn everything we knew about email marketing and start from the ground up.</p>\n<p>We’ve defined a few principles that really shaped the product.</p>\n<h3>Great starting points</h3>\n<p>Most email marketing tools give you a selection of templates that are either wireframes (and devoid of any personality) or fully-designed templates for fake brands that look nothing like your store does. With <a href=\"https://www.shopify.com/email-marketing\">Shopify Email</a>, the templates we show you are already using your brand colors, your logo, and your products. It’s a huge time-saver, but it can also give you ideas if you’re just getting started with email marketing.</p>\n<h3>Familiarity</h3>\n<p>A common pattern in email marketing is to have a multi-step flow where the user has to sequentially pick the customers, enter the subject line and finally get to crafting their actual email. In practice, we found it much more natural to be able to start wherever you want and jump between the different parts of your email freely. That’s why we decided to adopt a pattern much more similar to what you would see in Gmail, where you can edit whatever you want, whenever you want.</p>\n<h3>Creativity</h3>\n<p>While it’s important to us to give great starting points for our merchants, we know that the best emails are the ones that are carefully crafted. So we wanted the experience of customizing your email and crafting your content to be natural and fast. You can edit everything directly in the canvas, you have great flexibility over the look &#x26; feel and your changes are saved automatically (it’s 2019 afterall).</p>\n<p>I can’t wait to share more details about this project. Huge shout-out to <a href=\"https://www.linkedin.com/in/natalie-hercun-549b4a113/\">Natalie Hercun</a> on the Design, <a href=\"https://www.linkedin.com/in/katiedel/\">Katie Del Angel</a> on the Content Strategy and <a href=\"https://www.linkedin.com/in/longha0316/\">Long Ha</a> on UX Research.</p>","frontmatter":{"pretitle":"Introducing","title":"Shopify Email","date":"06.11.19"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/articles/shopify-email/"}}