{"data":{"markdownRemark":{"html":"<p>Now that I’m trying to post more to my site, I’m re-evaluating my setup. I’m currently using <a href=\"http://jekyllrb.com\">Jekyll</a> which has been mostly great, but has a few shortcomings.</p>\n<p>Here’s what my ideal setup would be:</p>\n<ul>\n<li>Is built on Ruby<sup id=\"fnref-1\"><a href=\"#fn-1\" class=\"footnote-ref\">1</a></sup>.</li>\n<li>Uses static Markdown files for each blog post.</li>\n<li>Has some sort of (REST?) API endpoint that allows me to write an iOS client<sup id=\"fnref-2\"><a href=\"#fn-2\" class=\"footnote-ref\">2</a></sup> to post from my iPhone.</li>\n</ul>\n<p>I was thinking of switching over to a Rails app and using a database, which would take care of point 1 and 3, but that means I would also have to design and build a web app to manage the content, which I’d rather avoid.</p>\n<p>Another avenue would be to stick with <a href=\"http://jekyllrb.com\">Jekyll</a> (or write my own flat file compiler) and use Dropbox to sync just the posts, but honestly I’ve had this setup before and it’s pretty flaky. Plus, I’d love to get my content versioned controlled if possible, this way I’m a lot less likely to lose data in the future.</p>\n<p>Could I keep a workflow that is similar to now, where all the content resides in static files in my site’s repo and have some way for the iOS app to commit changes to the flat files directly? Is that even possible?</p>\n<p>I’m just starting to dabble into that stuff, so if you have any ideas on what the best approach would be, it would be greatly appreciated if you could <a href=\"https://twitter.com/vernalkick\">tweet</a> or <a href=\"mailto:kevin@kevinclark.ca\">email me</a>. Of course, I’ll be keeping you updated on what I end up doing.</p>\n<div class=\"footnotes\">\n<hr>\n<ol>\n<li id=\"fn-1\">\n<p>I already know a bit of Ruby, and want to get better at it. I have no desire to use any other languages for this.</p>\n<a href=\"#fnref-1\" class=\"footnote-backref\">↩</a>\n</li>\n<li id=\"fn-2\">\n<p>I have a few ideas for an iOS client that I could make relatively easily. For example, one of the things I really want is a sharing extension to post links from within any app.</p>\n<a href=\"#fnref-2\" class=\"footnote-backref\">↩</a>\n</li>\n</ol>\n</div>","frontmatter":{"pretitle":null,"title":"My Ideal Setup","date":"09.12.14"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/articles/2014-12-09-my-ideal-setup/"}}