{"data":{"markdownRemark":{"html":"<p>A few days ago <a href=\"https://twitter.com/vernalkick/status/696170724034215936\">I asked</a> people on Twitter what was the best non-fiction book that they read recently. Fortunately, I got a lot of good recommendations. Keep in mind I haven’t read most of them, so I can’t vouch for them myself but I trust that my followers have great taste in books. If you have other recommendations, let me know and I’ll add them to my list!</p>\n<h2>Sapiens</h2>\n<p>Recommended by <a href=\"http://twitter.com/adammcnamara\">@adammcnamara</a> &#x26; <a href=\"http://twitter.com/h1brd\">@h1brd</a></p>\n<blockquote>\n<p>One hundred thousand years ago, at least six different species of humans inhabited Earth. Yet today there is only one—homo sapiens. What happened to the others? And what may happen to us?</p>\n</blockquote>\n<p><a href=\"http://www.amazon.ca/Sapiens-A-Brief-History-Humankind/dp/077103850X\">Buy on Amazon</a></p>\n<h2>Meaningful: The Story of Ideas that Fly</h2>\n<p>Recommended by <a href=\"http://twitter.com/DrewCoffman\">@DrewCoffman</a></p>\n<blockquote>\n<p>Our new digital landscape has spawned an entrepreneurial culture and the belief that anyone with a laptop and an Internet connection has the power to change the world—to create an idea that flies. But for every groundbreaking business that started this way, a thousand others have stalled or failed. Why? What’s the secret to success? What do Khan Academy, the GoPro camera, the Dyson vacuum cleaner and Kickstarter have in common? </p>\n</blockquote>\n<p>Drew also published a <a href=\"http://extratextuals.com/notes-from-meaningful-the-story-of-ideas-that-fly/\">great review of the book</a> on his blog. Definitely worth a read if you’re interested in the book.</p>\n<p><a href=\"http://www.amazon.com/Meaningful-The-Story-Ideas-That-ebook/dp/B016CUPB5K/ref=as_li_ss_tl?ie=UTF8&#x26;linkCode=sl1&#x26;tag=drewcoffmanco-20&#x26;linkId=4fa8d61440dda8ac6036c942204c057c\">Buy on Amazon</a></p>\n<h2>Meditations</h2>\n<p>Recommended by <a href=\"http://twitter.com/frankacy\">@Frankacy</a></p>\n<blockquote>\n<p>Meditations, by the Roman emperor Marcus Aurelius, incorporates the stoic precepts he used to cope with his life as a warrior and administrator of an empire. Ascending to the imperial throne, Aurelius found his reign beset by natural disasters and war. In the wake of these challenges, he set down a series of private reflections, outlining a philosophy of commitment to virtue above pleasure and tranquility above happiness.</p>\n</blockquote>\n<p><a href=\"http://www.amazon.ca/Meditations-Marcus-Aurelius/dp/048629823X\">Buy on Amazon</a></p>\n<h2>Hatching Twitter</h2>\n<p>Recommended by <a href=\"http://twitter.com/guttmnn\">@guttmnn</a></p>\n<blockquote>\n<p>Despite all the coverage of Twitter’s rise, Nick Bilton of The New York Times is the first journalist to tell the full story—a gripping drama of betrayed friendships and highstakes power struggles. The four founders—Evan Williams, Biz Stone, Jack Dorsey, and Noah Glass—made a dizzyingly fast transition from ordinary engineers to wealthy celebrities. They fought each other bitterly for money, influence, publicity, and control as Twitter grew larger and more powerful. Ultimately they all lost their grip on it.</p>\n</blockquote>\n<p>I’ve read this one right when it came out. I really recommend it if you want to better understand the success (and problems) of Twitter. It’s a super interesting read.</p>\n<p><a href=\"http://www.amazon.com/Hatching-Twitter-Story-Friendship-Betrayal/dp/1591847087\">Buy on Amazon</a></p>\n<h2>Things to Make and Do in the Fourth Dimension</h2>\n<p>Recommended by <a href=\"http://twitter.com/cjmlgrto\">@cjmlgrto</a></p>\n<blockquote>\n<p>Math is boring, says the mathematician and comedian Matt Parker. Part of the problem may be the way the subject is taught, but it’s also true that we all, to a greater or lesser extent, find math difficult and counterintuitive. This counterintuitiveness is actually part of the point, argues Parker: the extraordinary thing about math is that it allows us to access logic and ideas beyond what our brains can instinctively do—through its logical tools we are able to reach beyond our innate abilities and grasp more and more abstract concepts.</p>\n</blockquote>\n<p><a href=\"http://www.amazon.ca/Things-Make-Fourth-Dimension-Mathematicians/dp/0374275653\">Buy on Amazon</a></p>\n<h2>Creative Confidence</h2>\n<p>Recommended by <a href=\"http://twitter.com/itsneal\">@itsneal</a></p>\n<blockquote>\n<p>Too often, companies and individuals assume that creativity and innovation are the domain of the “creative types.” But two of the leading experts in innovation, design, and creativity on the planet show us that each and every one of us is creative. David and Tom Kelley identify the principles and strategies that will allow us to tap into our creative potential in our work lives, and in our personal lives, and allow us to innovate in terms of how we approach and solve problems.</p>\n</blockquote>\n<p><a href=\"http://www.amazon.com/Creative-Confidence-Unleashing-Potential-Within/dp/038534936X\">Buy on Amazon</a></p>\n<h2>Essentialism</h2>\n<p>Recommended by <a href=\"http://twitter.com/jules2689\">@jules2689</a></p>\n<blockquote>\n<p>The Way of the Essentialist isn’t about getting more done in less time. It’s not about getting less done. It’s about getting only the right things done. It’s about challenging the core assumption of ‘we can have it all’ and ‘I have to do everything’ and replacing it with the pursuit of ‘the right thing, in the right way, at the right time’. It’s about regaining control of our own choices about where to spend our time and energies instead of giving others implicit permission to choose for us.</p>\n</blockquote>\n<p><a href=\"http://www.amazon.com/Essentialism-The-Disciplined-Pursuit-Less/dp/0804137382\">Buy on Amazon</a></p>\n<h2>Start with Why</h2>\n<p>Recommended by <a href=\"http://twitter.com/ryanelward\">@ryanelward</a></p>\n<blockquote>\n<p>Any person or organization can explain what they do; some can explain how they are different or better; but very few can clearly articulate why. WHY is not about money or profit – those are results. WHY is the thing that inspires us and inspires those around us. </p>\n</blockquote>\n<p><a href=\"http://www.amazon.com/Start-Why-Leaders-Inspire-Everyone/dp/1591846447\">Buy on Amazon</a></p>","frontmatter":{"pretitle":null,"title":"Book Recommendations from Twitter","date":"2016-02-09"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/articles/2016-02-09-book-recommendations-from-twitter/"}}