{"data":{"markdownRemark":{"html":"<p><img src=\"/assets/articles/the-journey-to-my-first-ios-app/tipsy.jpg\"></p>\n<p>I work on the web day in, day out. I know the medium very well: its capabilities, its limitations, its opportunities and for a long time, mobile app design, didn’t sit right with me. The shadows, the textures, the principles just wasn’t my style. But that was before iOS 7. Say what you want about it, iOS 7  brought mobile app design much closer to what everyone else was doing on the web — including myself. Suddenly, designing for iOS became a lot more interesting for me.</p>\n<p>So I started looking for iOS classes or tutorials online, but most of them were either focused on learning how to achieve one specific aspect for someone who already knows the ins and outs of Objective-C or was so broad and so theoretical that I could’t bring myself to go through it all. Not long after, Josh Long and Sam Soffes announced <a href=\"https://executeios.com/\">Execute iOS</a>. It was exactly what I wanted: an experienced iOS developer reaches someone new to programming how to <a href=\"https://itunes.apple.com/us/app/execute/id797792004\">make a real iOS app</a>, top to bottom. No theory bullshit, just things you’re actually going to use. I bought it right away.</p>\n<p>Listening to the first few videos and following along, I was able to pick up the basics of Objective-C pretty quickly. The language is intimidating at first, but when you look past the square brackets and verbose method names, it’s a pretty good language.</p>\n<p>I was so motivated to write my own little app that I never actually finished watching all the videos. Towards the middle of the series I knew enough that I could get started and know what to Google for if there was something specific I didn’t know or remember.</p>\n<p>So in a few hours I designed and wrote <a href=\"https://itunes.apple.com/ca/app/tipsy-tip-calculator/id823047137\">Tipsy</a>, my first iOS app. It’s extremely simple and it’s definitely not changing the world but I’m super proud of it. You can <a href=\"https://itunes.apple.com/ca/app/tipsy-tip-calculator/id823047137\">download it for free</a> if you want to check it out. Since then, I’ve been working on a number of other iOS projects (mostly on apps that I want for myself) that I’ll tell you more about in time.</p>","frontmatter":{"pretitle":null,"title":"The Journey to my First iOS App","date":"2014-07-01T00:00:00.000Z"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/articles/2014-07-01-the-journey-to-my-first-ios-app/"}}