{"data":{"markdownRemark":{"html":"<p><a href=\"https://twitter.com/adilmajid\">Adil Majid</a> wrote <a href=\"http://adilmajid.com/twodegrees.html\">an excellent post</a> about a question I’ve often asked myself: “What did wildly successful people do differently from the rest of us when they were our age?“:</p>\n<blockquote>\n<p>I realized later that there are two ways to interpret his question. One is to examine people who are already successful today and ask “what did they do to become successful?” That’s a useful exercise, but […] a better way to word the question would be this: what are people our age who are going to be successful in 10–20 years doing right now?</p>\n</blockquote>\n<p>He identifies 4 ways people become extremely successful:</p>\n<ol>\n<li>Developing a leapfrog innovation (Google)</li>\n<li>Figuring out a complicated market (Facebook)</li>\n<li>Excelling in a particular vertical (Apple)</li>\n<li>Just getting lucky</li>\n</ol>\n<p>He continues:</p>\n<blockquote>\n<p>Three out of four of these paths share one major issue. The set of people working in an industry with an impending leapfrog innovation, disrupting a trainwreck market, or building expertise in something is massive. Only a few of them will become extremely successful, which means that even amongst that massive set, there need to be some differentiating factors that can increase someone’s chances of success.</p>\n</blockquote>\n<blockquote>\n<p>The best advice to folks my age seems to be the following. For your work, become an expert in something you find interesting, tackle a major problem people face, or work in a field where a leapfrog innovation seems imminent or necessary. Make small, two-degree changes on the path towards where you want to be one day.</p>\n</blockquote>\n<blockquote>\n<p>For yourself, minimize your bad habits while maximizing your good habits. Two degree changes you can commit to are better than fifty-degree changes that you’ll give up on. It could be the best way to increase your chances of being the next Larry Page or Mark Zuckerberg.</p>\n</blockquote>\n<p><a href=\"http://adilmajid.com/twodegrees.html\">Read the post on adilmajid.com</a></p>","frontmatter":{"pretitle":null,"title":"Two Degrees","date":"14.08.15"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/articles/2015-08-14-two-degrees/"}}